tests/src/serviceTest/resources/request/carteDematerialisee/v1/5_card_not_found_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bean="http://norme.cegedimassurances.com/carteDemat/beans">
    <soapenv:Header/>
    <soapenv:Body>
        <bean:carteDematerialiseeRequest>
            <bean:header_in>
                <bean:header_technique_in>
                    <bean:id_logiciel>idLogiciel</bean:id_logiciel>
                    <bean:version_logiciel>versionLogiciel</bean:version_logiciel>
                    <!--Optional:-->
                    <bean:editeur_logiciel>editeurLogiciel</bean:editeur_logiciel>
                    <!--Optional:-->
                    <bean:nom_logiciel>nomLogiciel</bean:nom_logiciel>
                    <!--Optional:-->
                    <bean:id_session_client>sessionClient</bean:id_session_client>
                    <!--Optional:-->
                    <bean:id_session_serveur></bean:id_session_serveur>
                    <bean:nom_norme>nomNorme</bean:nom_norme>
                    <bean:version_norme>versionNorme</bean:version_norme>
                </bean:header_technique_in>
                <bean:header_fonctionnel_in>
                    <!--Optional:-->
                    <bean:idDossier_client>dossierClient</bean:idDossier_client>
                    <!--Optional:-->
                    <bean:idDossier_serveur>dossierServeur</bean:idDossier_serveur>
                    <bean:code_proprietaire>codeProprietaire</bean:code_proprietaire>
                    <!--Optional:-->
                    <bean:code_gestionnaire>codeGestionnaire</bean:code_gestionnaire>
                    <!--Optional:-->
                    <bean:num_accreditation>numAccreditation</bean:num_accreditation>
                    <!--Optional:-->
                    <bean:num_otp>?</bean:num_otp>
                </bean:header_fonctionnel_in>
            </bean:header_in>
            <bean:request>
                <bean:numeroAMC>0000000001</bean:numeroAMC>
                <!--Optional:-->
                <bean:nomAMC>?</bean:nomAMC>
                <bean:dateReference>_DATE_</bean:dateReference>
                <bean:numeroContrat>900044519</bean:numeroContrat>
            </bean:request>
        </bean:carteDematerialiseeRequest>
    </soapenv:Body>
</soapenv:Envelope>
